Revit 2026 API

# FlowConversionMode Enumeration

---

Enumerated type listing possible flow conversion modes for piping calculations.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FlowConversionMode
```
```vb
Public Enumeration FlowConversionMode
```
```cpp
public enum class FlowConversionMode
```
```fsharp
type FlowConversionMode
```

| Member name | Value | Description |
| --- | --- | --- |
| Invalid | -1 | A default value which should not be assigned to system types. |
| Tanks | 1 | Predominantly flush tanks. |
| Valves | 0 | Predominantly flush valves. |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace